## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                         NAME                          |
|----------|-------------------------------------------------------|
| recreate | `aws_route53_record.url-shortener-alpha-canada-ca-NS` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.url-shortener-alpha-canada-ca-NS must be replaced
-/+ resource "aws_route53_record" "url-shortener-alpha-canada-ca-NS" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "url-shortener.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z33C47YI9EN8XL_url-shortener.alpha.canada.ca_NS" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
      ~ name                             = "url-shortener.alpha.canada.ca" -> "o.alpha.canada.ca" # forces replacement
      ~ records                          = [
          + "ns-1053.awsdns-03.org.",
          - "ns-1259.awsdns-29.org",
          + "ns-1594.awsdns-07.co.uk.",
          - "ns-1942.awsdns-50.co.uk",
          + "ns-308.awsdns-38.com.",
          - "ns-720.awsdns-26.net",
          + "ns-788.awsdns-34.net.",
          - "ns-8.awsdns-01.com",
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
